# 2. Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# in
# 4

# out
# [2, 5, 8, 10]
# [20, 40]

# in
# 5

# out
# [2, 2, 4, 8, 8]
# [16, 16, 4]




# import random

# def find_number(amount):
#     random_list = random.sample(range(1, amount * 2), k=amount)
#     print(random_list)
#     new_list = []
#     num = len(random_list)
#     while new_list // 2:
#         new_list.append(random_list[0] * random_list[num- 1])
  


# find_number(int(input("Введите размер списка: ")))



